Revit 2027 API
FabricationConfiguration.GetAllServices Method
 Returns all fabrication services in the fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationService> GetAllServices()
Public Function GetAllServices As IList(Of FabricationService)
public:
IList<FabricationService^>^ GetAllServices()
member GetAllServices : unit -> IList<FabricationService>
Return Value
IList<FabricationService>
 All fabrication services. The return will be empty if no services are found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace